
MODERATOR_LINES = {
    "WELCOME": "Добро пожаловать на 'Интеллектуальный Поединок'!",
    "PROMPT": "Сформулируй краткое, официальное вступление к дебатам на тему '{topic}'. Сделай краткое введение в эту проблематику. Объяви участников: '{user_name}' и '{opponent_name}'. ВАЖНО: не распределяй позиции участников (кто за, кто против) и не придумывай за них аргументы — они сами их озвучат. Твоя задача — только представить тему и оппонентов.",

    "USER_START": "Слово для вступительной речи предоставляется {speaker_name}. У вас полторы минуты.",
    "USER_START_2": "Благодарю. Теперь слово для вступительной речи предоставляется {speaker_name}.",
    "CLASH_ROUND_START": "Вступительные заявления завершены. Переходим к раундам полемики. Инициатива у {speaker_name}. Ваше время: четыре минуты.",
    "CLASH_ROUND_CONTINUE": "Теперь инициатива у {speaker_name}. Ваше время: четыре минуты.",

    "CLASH_ROUND_END": "Время раунда истекло.",
    "JURY_QUESTIONS_START": "Раунд полемики завершен. Слово передается коллегии жюри для перекрестного допроса.",

    "SUMMARY": "Ну и жаркими же получились дебаты! Что же, время переходить к финальным словам. {speaker_name} вам предоставляется финальное слово, 1 минута",
    "SUMMARY_2": "{speaker_name} вам предоставляется финальное слово, 1 минута",

    "FINAL_VERDICT": "Дебаты завершены. Предоставляю слово жюри для оглашения вердикта.",
    "GOODBYE": "На этом наши дебаты окончены. Спасибо за участие."
}